---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings.#ctor
source: html/65b5cb2e-ac1b-fad5-b101-43d26eab6022.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings.#ctor Method

Constructs a default instance of colored surface settings.

## Syntax (C#)
```csharp
public AnalysisDisplayColoredSurfaceSettings()
```